# CLI tools
brew "neovim"
brew "btop"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "jq"
brew "tree"
brew "wget"
brew "zoxide"
brew "bat"
brew "docker"
brew "fnm"
brew "glab"
brew "lazygit"
brew "sqlite"
brew "stow"

# Desktop apps
cask "wezterm"
cask "slack"
cask "arc"
cask "raycast"
cask "macs-fan-control"
cask "betterdisplay"
cask "ice"
cask "claude"
cask "obsidian"
cask "postman"
